blog/2016-06-11-linux网络监控工具-iftop.org
#+TITLE: Linux网络监控工具-iftop
#+DATE: 2016-03-24
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Linux工具
#+JEKYLL_TAGS: Linux 网络 监控工具
#+JEKYLL_PUBLISHED: true

介绍了网络实时流量检测工具iftop的使用




-----
* iftop的作用
iftop可以监控指定网卡的实时流量、端口连接信息、反向解析IP等，还可以精确显示本机网络流量情况及网络内各主机与本机相互通信的流量集合，非常适合于监控代理服务器或路由器的网络流量。

* iftop常用参数
- i：指定监测的网卡（常用）
- n：不进行DNS反向解析
- B：以byte显示网卡流量，默认是bit
- p：以混杂模式进行iftop，可作网络嗅探器
- N：直接显示端口号
- P：显示主机以及端口信息（常用）
- F：指定网段
- M：指定流量刻度最大值

* iftop的输出
iftop的输出从整体上可以分为三大部分。
- 第一部分是iftop输出中最上面的一行，此行信息是流量刻度，用于显示网卡带宽流量。
- 第二部分是iftop输出中最大的一个部分，此部分又分为左、中、右三列，左列和中列记录了哪些IP或主机正在和本机的网络进行连接。\\
  其中，中列的“=>”代表发送数据，“<=”代表接收数据，通过这个指示箭头可以很清晰地知道两个IP之间的通信情况。\\
  最右列又分为三小列，这些实时参数分别表示外部IP连接到本机2s、10s和40s内的平均流量值。\\
  这个部分还有一个流量图形条，流量图形条是对流量大小的动态展示，以第一部分中的流量刻度为基准。
- 第三部分位于iftop输出的最下面，可以分为三行，其中，“TX”表示发送数据，“RX”表示接收数据，“TOTAL”表示发送和接收的全部流量。\\
  与这三行对应的有三列，其中，“cum”列表示从运行iftop到目前的发送、接收和总数据流量；“peak”列表示发送、接收以及总的流量峰值；“rates”列表示过去2s、10s、40s内的平均流量值。


